package calculator

type Hands struct {
	grouped []TileGroup
	ungrouped []int
	won bool
	score int
	winnngTile int // position of winningTile
}

type TileGroup struct {
	tiles []int
	open bool
	pong bool
	kong bool 
	chi bool
	pair bool
	pattern int // 1 - 筒, 2 - 条, 3 - 万 4 - 字 5 - Mixed
}

type Output struct {
	names []string
	score int
	exceptions []int
}

var PatternLib = map[int][]int {
	// 筒
	1: {1, 2, 3, 4, 5, 6, 7, 8, 9},
	// 条
	2: {10, 11, 12, 13, 14, 15, 16, 17, 18},
	// 万
	3: {19, 20, 21, 22, 23, 24, 25, 26, 27},
	// 字
	4: {28, 29, 30, 31, 32, 33, 34},
}

// map tiles to id
var TilesMaps = map[int]string{
	1: "一筒",
	2: "二筒",
	3: "三筒",
	4: "四筒",
	5: "五筒",
	6: "六筒",
	7: "七筒",
	8: "八筒",
	9: "九筒",
	10: "一条",
	11: "二条",
	12: "三条",
	13: "四条",
	14: "五条",
	15: "六条",
	16: "七条",
	17: "八条",
	18: "九条",
	19: "一万",
	20: "二万",
	21: "三万",
	22: "四万",
	23: "五万",
	24: "六万",
	25: "七万",
	26: "八万",
	27: "九万",
	28: "东",
	29: "南",
	30: "西",
	31: "北",
	32: "红中",
	33: "禄发",
	34: "白扳",
	35: "春",
	36: "夏",
	37: "秋",
	38: "冬",
	39: "梅",
	40: "兰",
	41: "竹",
	42: "菊",
}

// map ruleFunc to id
var RulesMaps = map[int]interface{}{
	1: 大四喜,
	2: 大三元,
	3: 绿一色,
	4: 九莲宝灯,
	5: 四杠,
	6: 连七对,
	7: 十三幺,
	8: 清幺九,
	9: 小四喜,
	10: 小三元,
	11: 字一色,
	12: 四暗刻,
	13: 一色双龙会,
	14: 一色四同顺,
	15: 一色四节高,
	16: 一色四步高,
	17: 三杠,
	18: 混幺九,
	19: 七对,
	20: 七星不靠,
	21: 全双刻,
	22: 清一色,
	23: 一色三同顺,
	24: 一色三节高,
	25: 全大,
	26: 全中,
	27: 全小,
	28: 清龙,
	29: 三色双龙会,
	30: 一色三步高,
	31: 全带五,
	32: 三同刻,
	33: 三暗刻,
	34: 全不靠,
	35: 组合龙,
	36: 大于五,
	37: 小于五,
	38: 三风刻,
	39: 花龙,
	40: 推不倒,
	41: 三色三同顺,
	42: 三色三节高,
	43: 无番和,
	44: 妙手回春,
	45: 海底捞月,
	46: 杠上开花,
	47: 抢杠和,
	48: 碰碰和,
	49: 混一色,
	50: 三色三步高,
	51: 五门齐,
	52: 全求人,
	53: 双暗杠,
	54: 双箭刻,
	55: 全带幺,
	56: 不求人,
	57: 双明杠,
	58: 和绝张,
	59: 箭刻,
	60: 圈风刻,
	61: 门风刻,
	62: 门前清,
	63: 平和,
	64: 四归一,
	65: 双同刻,
	66: 双暗刻,
	67: 暗杠,
	68: 断幺,
	69: 一般高,
	70: 喜相逢,
	71: 连六,
	72: 老少副,
	73: 幺九刻,
	74: 明杠,
	75: 缺一门,
	76: 无字,
	77: 边张,
	78: 坎张,
	79: 单钓,
}